{
  "title": "Gde da izgradimo grad?",
  "audience": "osnovna škola",
  "description": "Ovaj alat omogućava učenicima da izaberu prirodne oblasti na interaktivnoj mapi i saznaju kako te oblasti utiču na razvoj grada i dostupne resurse. Svaka oblast je jasno definisana kao zaseban oblik sa sopstvenom bojom i tekstualnim objašnjenjem.",
  "initial": "Na ekranu je prikazana jednostavna mapa sa dovoljno detalja sa jasno označenim i obojenim oblastima: plava poligonalna oblast označava reku, siva poligonalna oblast označava planinu, a zelena oblast označava šumu. Iznad mape stoji tekst 'Izaberi oblast da vidiš mogućnosti razvoja grada'.",
  "interactions": [
    {
      "if": "klik na plavu oblast (reku)",
      "then_first": "Prikaži tekstualni opis u desnom panelu: 'Grad pored reke – razvijeno ribarstvo, transport i trgovina. Nedostatak: drvo i kamen.'",
      "then_next": [
        "Dodaj prikaz animirane ikone broda u reci i promeni tekst na: 'Luka se razvija, ali nema dovoljno materijala za velike građevine.'"
      ],
      "position": "Plava oblast u donjem delu mape, jasno izdvojena i klikabilna.",
      "style": "Plava oblast sa providnim prelazima i ivicama. Tekst se prikazuje u posebnom desnom panelu."
    },
    {
      "if": "klik na sivu oblast (planinu)",
      "then_first": "Prikaži tekst u desnom panelu: 'Planinski grad – dostupni su kamenolomi i rudnici. Nedostatak: voda i plodno zemljište.'",
      "then_next": [
        "Dodaj animirani dim iz rudnika i promeni tekst na: 'Industrija raste, ali razvoj je ograničen usled nepovoljnih uslova za poljoprivredu.'"
      ],
      "position": "Siva oblast sa trouglastim vrhovima na levoj strani mape.",
      "style": "Siva oblast sa jasnim granicama, tekstualni panel se ažurira u desnom delu ekrana."
    },
    {
      "if": "klik na zelenu oblast (šumu)",
      "then_first": "Prikaži opis u desnom panelu: 'Šumski grad – dostupno drvo i lov, ali nedostaju kamen i trgovačke rute.'",
      "then_next": [
        "Dodaj animaciju drvoseče i ažuriraj tekst na: 'Grad raste sporo zbog loših veza sa ostalim oblastima.'"
      ],
      "position": "Zelena oblast desno na mapi sa gustim ikonama drveća.",
      "style": "Zelena oblast sa teksturama drveća, panel sa tekstom se pojavljuje sa desne strane."
    }
  ],
  "extras": "Klik na oblast zumira mapu na tu regiju i prikazuje animirane simbole. Na ekranu postoji dugme 'Izaberi drugu oblast' koje vraća početni prikaz mape i briše animacije i tekst."
}
